Microchip-MPLAB-Harmony/csp/apps/adc/adc_sample/firmware/src/packs/ATSAMHA1G16AB_DFP/pio/samha1g16ab.h
/**
 * \brief Peripheral I/O description for SAMHA1G16AB
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-10-21T09:26:56Z */
#ifndef _SAMHA1G16AB_GPIO_H_
#define _SAMHA1G16AB_GPIO_H_

/* ========== Peripheral I/O pin numbers ========== */
#define PIN_PA00                    (  0  )  /**< Pin Number for PA00 */
#define PIN_PA01                    (  1  )  /**< Pin Number for PA01 */
#define PIN_PA02                    (  2  )  /**< Pin Number for PA02 */
#define PIN_PA03                    (  3  )  /**< Pin Number for PA03 */
#define PIN_PA04                    (  4  )  /**< Pin Number for PA04 */
#define PIN_PA05                    (  5  )  /**< Pin Number for PA05 */
#define PIN_PA06                    (  6  )  /**< Pin Number for PA06 */
#define PIN_PA07                    (  7  )  /**< Pin Number for PA07 */
#define PIN_PA08                    (  8  )  /**< Pin Number for PA08 */
#define PIN_PA09                    (  9  )  /**< Pin Number for PA09 */
#define PIN_PA10                    ( 10  )  /**< Pin Number for PA10 */
#define PIN_PA11                    ( 11  )  /**< Pin Number for PA11 */
#define PIN_PA14                    ( 14  )  /**< Pin Number for PA14 */
#define PIN_PA15                    ( 15  )  /**< Pin Number for PA15 */
#define PIN_PA16                    ( 16  )  /**< Pin Number for PA16 */
#define PIN_PA17                    ( 17  )  /**< Pin Number for PA17 */
#define PIN_PA18                    ( 18  )  /**< Pin Number for PA18 */
#define PIN_PA19                    ( 19  )  /**< Pin Number for PA19 */
#define PIN_PA20                    ( 20  )  /**< Pin Number for PA20 */
#define PIN_PA21                    ( 21  )  /**< Pin Number for PA21 */
#define PIN_PA27                    ( 27  )  /**< Pin Number for PA27 */
#define PIN_PA28                    ( 28  )  /**< Pin Number for PA28 */
#define PIN_PA30                    ( 30  )  /**< Pin Number for PA30 */
#define PIN_PA31                    ( 31  )  /**< Pin Number for PA31 */
#define PIN_PB03                    ( 35  )  /**< Pin Number for PB03 */
#define PIN_PB06                    ( 38  )  /**< Pin Number for PB06 */
#define PIN_PB07                    ( 39  )  /**< Pin Number for PB07 */
#define PIN_PB10                    ( 42  )  /**< Pin Number for PB10 */
#define PIN_PB11                    ( 43  )  /**< Pin Number for PB11 */
#define PIN_PB16                    ( 48  )  /**< Pin Number for PB16 */
#define PIN_PB17                    ( 49  )  /**< Pin Number for PB17 */
#define PIN_PB22                    ( 54  )  /**< Pin Number for PB22 */
#define PIN_PB23                    ( 55  )  /**< Pin Number for PB23 */
#define PIN_PB30                    ( 62  )  /**< Pin Number for PB30 */

/* ========== Peripheral I/O masks ========== */
#define PORT_PA00                   _UL_(_U_(1) << 0) /**< PORT mask for PA00 */
#define PORT_PA01                   _UL_(_U_(1) << 1) /**< PORT mask for PA01 */
#define PORT_PA02                   _UL_(_U_(1) << 2) /**< PORT mask for PA02 */
#define PORT_PA03                   _UL_(_U_(1) << 3) /**< PORT mask for PA03 */
#define PORT_PA04                   _UL_(_U_(1) << 4) /**< PORT mask for PA04 */
#define PORT_PA05                   _UL_(_U_(1) << 5) /**< PORT mask for PA05 */
#define PORT_PA06                   _UL_(_U_(1) << 6) /**< PORT mask for PA06 */
#define PORT_PA07                   _UL_(_U_(1) << 7) /**< PORT mask for PA07 */
#define PORT_PA08                   _UL_(_U_(1) << 8) /**< PORT mask for PA08 */
#define PORT_PA09                   _UL_(_U_(1) << 9) /**< PORT mask for PA09 */
#define PORT_PA10                   _UL_(_U_(1) << 10) /**< PORT mask for PA10 */
#define PORT_PA11                   _UL_(_U_(1) << 11) /**< PORT mask for PA11 */
#define PORT_PA14                   _UL_(_U_(1) << 14) /**< PORT mask for PA14 */
#define PORT_PA15                   _UL_(_U_(1) << 15) /**< PORT mask for PA15 */
#define PORT_PA16                   _UL_(_U_(1) << 16) /**< PORT mask for PA16 */
#define PORT_PA17                   _UL_(_U_(1) << 17) /**< PORT mask for PA17 */
#define PORT_PA18                   _UL_(_U_(1) << 18) /**< PORT mask for PA18 */
#define PORT_PA19                   _UL_(_U_(1) << 19) /**< PORT mask for PA19 */
#define PORT_PA20                   _UL_(_U_(1) << 20) /**< PORT mask for PA20 */
#define PORT_PA21                   _UL_(_U_(1) << 21) /**< PORT mask for PA21 */
#define PORT_PA27                   _UL_(_U_(1) << 27) /**< PORT mask for PA27 */
#define PORT_PA28                   _UL_(_U_(1) << 28) /**< PORT mask for PA28 */
#define PORT_PA30                   _UL_(_U_(1) << 30) /**< PORT mask for PA30 */
#define PORT_PA31                   _UL_(_U_(1) << 31) /**< PORT mask for PA31 */
#define PORT_PB03                   _UL_(_U_(1) << 3) /**< PORT mask for PB03 */
#define PORT_PB06                   _UL_(_U_(1) << 6) /**< PORT mask for PB06 */
#define PORT_PB07                   _UL_(_U_(1) << 7) /**< PORT mask for PB07 */
#define PORT_PB10                   _UL_(_U_(1) << 10) /**< PORT mask for PB10 */
#define PORT_PB11                   _UL_(_U_(1) << 11) /**< PORT mask for PB11 */
#define PORT_PB16                   _UL_(_U_(1) << 16) /**< PORT mask for PB16 */
#define PORT_PB17                   _UL_(_U_(1) << 17) /**< PORT mask for PB17 */
#define PORT_PB22                   _UL_(_U_(1) << 22) /**< PORT mask for PB22 */
#define PORT_PB23                   _UL_(_U_(1) << 23) /**< PORT mask for PB23 */
#define PORT_PB30                   _UL_(_U_(1) << 30) /**< PORT mask for PB30 */

/* ========== PORT definition for AC peripheral ========== */
#define PIN_PA04B_AC_AIN0                          (4L)         
#define MUX_PA04B_AC_AIN0                          (1L)        
#define PINMUX_PA04B_AC_AIN0                       ((PIN_PA04B_AC_AIN0 << 16) | MUX_PA04B_AC_AIN0)
#define PORT_PA04B_AC_AIN0                         ((1UL) << 4)

