Microchip-MPLAB-Harmony/csp/apps/adc/adc_sample/firmware/src/packs/ATSAMHA1G16AB_DFP/pio/samha1g16ab.h
#define PIN_PA21H_GCLK_IO5                         (21L)        
#define MUX_PA21H_GCLK_IO5                         (7L)        
#define PINMUX_PA21H_GCLK_IO5                      ((PIN_PA21H_GCLK_IO5 << 16) | MUX_PA21H_GCLK_IO5)
#define PORT_PA21H_GCLK_IO5                        ((1UL) << 21)

#define PIN_PB11H_GCLK_IO5                         (43L)        
#define MUX_PB11H_GCLK_IO5                         (7L)        
#define PINMUX_PB11H_GCLK_IO5                      ((PIN_PB11H_GCLK_IO5 << 16) | MUX_PB11H_GCLK_IO5)
#define PORT_PB11H_GCLK_IO5                        ((1UL) << 11)

/* ========== PORT definition for PTC peripheral ========== */
#define PIN_PA08B_PTC_X0                           (8L)         
#define MUX_PA08B_PTC_X0                           (1L)        
#define PINMUX_PA08B_PTC_X0                        ((PIN_PA08B_PTC_X0 << 16) | MUX_PA08B_PTC_X0)
#define PORT_PA08B_PTC_X0                          ((1UL) << 8)

#define PIN_PA09B_PTC_X1                           (9L)         
#define MUX_PA09B_PTC_X1                           (1L)        
#define PINMUX_PA09B_PTC_X1                        ((PIN_PA09B_PTC_X1 << 16) | MUX_PA09B_PTC_X1)
#define PORT_PA09B_PTC_X1                          ((1UL) << 9)

#define PIN_PA10B_PTC_X2                           (10L)        
#define MUX_PA10B_PTC_X2                           (1L)        
#define PINMUX_PA10B_PTC_X2                        ((PIN_PA10B_PTC_X2 << 16) | MUX_PA10B_PTC_X2)
#define PORT_PA10B_PTC_X2                          ((1UL) << 10)

#define PIN_PA11B_PTC_X3                           (11L)        
#define MUX_PA11B_PTC_X3                           (1L)        
#define PINMUX_PA11B_PTC_X3                        ((PIN_PA11B_PTC_X3 << 16) | MUX_PA11B_PTC_X3)
#define PORT_PA11B_PTC_X3                          ((1UL) << 11)

#define PIN_PA16B_PTC_X4                           (16L)        
#define MUX_PA16B_PTC_X4                           (1L)        
#define PINMUX_PA16B_PTC_X4                        ((PIN_PA16B_PTC_X4 << 16) | MUX_PA16B_PTC_X4)
#define PORT_PA16B_PTC_X4                          ((1UL) << 16)

#define PIN_PA17B_PTC_X5                           (17L)        
#define MUX_PA17B_PTC_X5                           (1L)        
#define PINMUX_PA17B_PTC_X5                        ((PIN_PA17B_PTC_X5 << 16) | MUX_PA17B_PTC_X5)
#define PORT_PA17B_PTC_X5                          ((1UL) << 17)

#define PIN_PA18B_PTC_X6                           (18L)        
#define MUX_PA18B_PTC_X6                           (1L)        
#define PINMUX_PA18B_PTC_X6                        ((PIN_PA18B_PTC_X6 << 16) | MUX_PA18B_PTC_X6)
#define PORT_PA18B_PTC_X6                          ((1UL) << 18)

#define PIN_PA19B_PTC_X7                           (19L)        
#define MUX_PA19B_PTC_X7                           (1L)        
#define PINMUX_PA19B_PTC_X7                        ((PIN_PA19B_PTC_X7 << 16) | MUX_PA19B_PTC_X7)
#define PORT_PA19B_PTC_X7                          ((1UL) << 19)

#define PIN_PA20B_PTC_X8                           (20L)        
#define MUX_PA20B_PTC_X8                           (1L)        
#define PINMUX_PA20B_PTC_X8                        ((PIN_PA20B_PTC_X8 << 16) | MUX_PA20B_PTC_X8)
#define PORT_PA20B_PTC_X8                          ((1UL) << 20)

#define PIN_PA21B_PTC_X9                           (21L)        
#define MUX_PA21B_PTC_X9                           (1L)        
#define PINMUX_PA21B_PTC_X9                        ((PIN_PA21B_PTC_X9 << 16) | MUX_PA21B_PTC_X9)
#define PORT_PA21B_PTC_X9                          ((1UL) << 21)

#define PIN_PA02B_PTC_Y0                           (2L)         
#define MUX_PA02B_PTC_Y0                           (1L)        
#define PINMUX_PA02B_PTC_Y0                        ((PIN_PA02B_PTC_Y0 << 16) | MUX_PA02B_PTC_Y0)
#define PORT_PA02B_PTC_Y0                          ((1UL) << 2)

#define PIN_PA03B_PTC_Y1                           (3L)         
#define MUX_PA03B_PTC_Y1                           (1L)        
#define PINMUX_PA03B_PTC_Y1                        ((PIN_PA03B_PTC_Y1 << 16) | MUX_PA03B_PTC_Y1)
#define PORT_PA03B_PTC_Y1                          ((1UL) << 3)

#define PIN_PA04B_PTC_Y2                           (4L)         
#define MUX_PA04B_PTC_Y2                           (1L)        
#define PINMUX_PA04B_PTC_Y2                        ((PIN_PA04B_PTC_Y2 << 16) | MUX_PA04B_PTC_Y2)
#define PORT_PA04B_PTC_Y2                          ((1UL) << 4)

#define PIN_PA05B_PTC_Y3                           (5L)         
#define MUX_PA05B_PTC_Y3                           (1L)        
#define PINMUX_PA05B_PTC_Y3                        ((PIN_PA05B_PTC_Y3 << 16) | MUX_PA05B_PTC_Y3)
#define PORT_PA05B_PTC_Y3                          ((1UL) << 5)

#define PIN_PA06B_PTC_Y4                           (6L)         
#define MUX_PA06B_PTC_Y4                           (1L)        
#define PINMUX_PA06B_PTC_Y4                        ((PIN_PA06B_PTC_Y4 << 16) | MUX_PA06B_PTC_Y4)
#define PORT_PA06B_PTC_Y4                          ((1UL) << 6)

#define PIN_PA07B_PTC_Y5                           (7L)         
#define MUX_PA07B_PTC_Y5                           (1L)        
#define PINMUX_PA07B_PTC_Y5                        ((PIN_PA07B_PTC_Y5 << 16) | MUX_PA07B_PTC_Y5)
#define PORT_PA07B_PTC_Y5                          ((1UL) << 7)

#define PIN_PB03B_PTC_Y9                           (35L)        
#define MUX_PB03B_PTC_Y9                           (1L)        
#define PINMUX_PB03B_PTC_Y9                        ((PIN_PB03B_PTC_Y9 << 16) | MUX_PB03B_PTC_Y9)
#define PORT_PB03B_PTC_Y9                          ((1UL) << 3)

#define PIN_PB06B_PTC_Y12                          (38L)        
#define MUX_PB06B_PTC_Y12                          (1L)        
#define PINMUX_PB06B_PTC_Y12                       ((PIN_PB06B_PTC_Y12 << 16) | MUX_PB06B_PTC_Y12)
#define PORT_PB06B_PTC_Y12                         ((1UL) << 6)

#define PIN_PB07B_PTC_Y13                          (39L)        
#define MUX_PB07B_PTC_Y13                          (1L)        
#define PINMUX_PB07B_PTC_Y13                       ((PIN_PB07B_PTC_Y13 << 16) | MUX_PB07B_PTC_Y13)
#define PORT_PB07B_PTC_Y13                         ((1UL) << 7)

/* ========== PORT definition for SERCOM0 peripheral ========== */
#define PIN_PA04D_SERCOM0_PAD0                     (4L)         
#define MUX_PA04D_SERCOM0_PAD0                     (3L)        
#define PINMUX_PA04D_SERCOM0_PAD0                  ((PIN_PA04D_SERCOM0_PAD0 << 16) | MUX_PA04D_SERCOM0_PAD0)
#define PORT_PA04D_SERCOM0_PAD0                    ((1UL) << 4)

