Microchip-MPLAB-Harmony/csp/apps/adc/adc_sample/firmware/src/packs/ATSAMHA1G16AB_DFP/pio/samha1g16ab.h
/* ========== PORT definition for TC5 peripheral ========== */
#define PIN_PB10E_TC5_WO0                          (42L)        
#define MUX_PB10E_TC5_WO0                          (4L)        
#define PINMUX_PB10E_TC5_WO0                       ((PIN_PB10E_TC5_WO0 << 16) | MUX_PB10E_TC5_WO0)
#define PORT_PB10E_TC5_WO0                         ((1UL) << 10)

#define PIN_PA27E_TC5_WO0                          (27L)        
#define MUX_PA27E_TC5_WO0                          (4L)        
#define PINMUX_PA27E_TC5_WO0                       ((PIN_PA27E_TC5_WO0 << 16) | MUX_PA27E_TC5_WO0)
#define PORT_PA27E_TC5_WO0                         ((1UL) << 27)

#define PIN_PB11E_TC5_WO1                          (43L)        
#define MUX_PB11E_TC5_WO1                          (4L)        
#define PINMUX_PB11E_TC5_WO1                       ((PIN_PB11E_TC5_WO1 << 16) | MUX_PB11E_TC5_WO1)
#define PORT_PB11E_TC5_WO1                         ((1UL) << 11)

#define PIN_PA28E_TC5_WO1                          (28L)        
#define MUX_PA28E_TC5_WO1                          (4L)        
#define PINMUX_PA28E_TC5_WO1                       ((PIN_PA28E_TC5_WO1 << 16) | MUX_PA28E_TC5_WO1)
#define PORT_PA28E_TC5_WO1                         ((1UL) << 28)

/* ========== PORT definition for TC6 peripheral ========== */
#define PIN_PB16E_TC6_WO0                          (48L)        
#define MUX_PB16E_TC6_WO0                          (4L)        
#define PINMUX_PB16E_TC6_WO0                       ((PIN_PB16E_TC6_WO0 << 16) | MUX_PB16E_TC6_WO0)
#define PORT_PB16E_TC6_WO0                         ((1UL) << 16)

#define PIN_PB03E_TC6_WO1                          (35L)        
#define MUX_PB03E_TC6_WO1                          (4L)        
#define PINMUX_PB03E_TC6_WO1                       ((PIN_PB03E_TC6_WO1 << 16) | MUX_PB03E_TC6_WO1)
#define PORT_PB03E_TC6_WO1                         ((1UL) << 3)

#define PIN_PB17E_TC6_WO1                          (49L)        
#define MUX_PB17E_TC6_WO1                          (4L)        
#define PINMUX_PB17E_TC6_WO1                       ((PIN_PB17E_TC6_WO1 << 16) | MUX_PB17E_TC6_WO1)
#define PORT_PB17E_TC6_WO1                         ((1UL) << 17)

/* ========== PORT definition for TC7 peripheral ========== */
#define PIN_PA20E_TC7_WO0                          (20L)        
#define MUX_PA20E_TC7_WO0                          (4L)        
#define PINMUX_PA20E_TC7_WO0                       ((PIN_PA20E_TC7_WO0 << 16) | MUX_PA20E_TC7_WO0)
#define PORT_PA20E_TC7_WO0                         ((1UL) << 20)

#define PIN_PB22E_TC7_WO0                          (54L)        
#define MUX_PB22E_TC7_WO0                          (4L)        
#define PINMUX_PB22E_TC7_WO0                       ((PIN_PB22E_TC7_WO0 << 16) | MUX_PB22E_TC7_WO0)
#define PORT_PB22E_TC7_WO0                         ((1UL) << 22)

#define PIN_PA21E_TC7_WO1                          (21L)        
#define MUX_PA21E_TC7_WO1                          (4L)        
#define PINMUX_PA21E_TC7_WO1                       ((PIN_PA21E_TC7_WO1 << 16) | MUX_PA21E_TC7_WO1)
#define PORT_PA21E_TC7_WO1                         ((1UL) << 21)

#define PIN_PB23E_TC7_WO1                          (55L)        
#define MUX_PB23E_TC7_WO1                          (4L)        
#define PINMUX_PB23E_TC7_WO1                       ((PIN_PB23E_TC7_WO1 << 16) | MUX_PB23E_TC7_WO1)
#define PORT_PB23E_TC7_WO1                         ((1UL) << 23)

/* ========== PORT definition for TCC0 peripheral ========== */
#define PIN_PA04E_TCC0_WO0                         (4L)         
#define MUX_PA04E_TCC0_WO0                         (4L)        
#define PINMUX_PA04E_TCC0_WO0                      ((PIN_PA04E_TCC0_WO0 << 16) | MUX_PA04E_TCC0_WO0)
#define PORT_PA04E_TCC0_WO0                        ((1UL) << 4)

#define PIN_PA08E_TCC0_WO0                         (8L)         
#define MUX_PA08E_TCC0_WO0                         (4L)        
#define PINMUX_PA08E_TCC0_WO0                      ((PIN_PA08E_TCC0_WO0 << 16) | MUX_PA08E_TCC0_WO0)
#define PORT_PA08E_TCC0_WO0                        ((1UL) << 8)

#define PIN_PB30E_TCC0_WO0                         (62L)        
#define MUX_PB30E_TCC0_WO0                         (4L)        
#define PINMUX_PB30E_TCC0_WO0                      ((PIN_PB30E_TCC0_WO0 << 16) | MUX_PB30E_TCC0_WO0)
#define PORT_PB30E_TCC0_WO0                        ((1UL) << 30)

#define PIN_PA05E_TCC0_WO1                         (5L)         
#define MUX_PA05E_TCC0_WO1                         (4L)        
#define PINMUX_PA05E_TCC0_WO1                      ((PIN_PA05E_TCC0_WO1 << 16) | MUX_PA05E_TCC0_WO1)
#define PORT_PA05E_TCC0_WO1                        ((1UL) << 5)

#define PIN_PA09E_TCC0_WO1                         (9L)         
#define MUX_PA09E_TCC0_WO1                         (4L)        
#define PINMUX_PA09E_TCC0_WO1                      ((PIN_PA09E_TCC0_WO1 << 16) | MUX_PA09E_TCC0_WO1)
#define PORT_PA09E_TCC0_WO1                        ((1UL) << 9)

#define PIN_PA10F_TCC0_WO2                         (10L)        
#define MUX_PA10F_TCC0_WO2                         (5L)        
#define PINMUX_PA10F_TCC0_WO2                      ((PIN_PA10F_TCC0_WO2 << 16) | MUX_PA10F_TCC0_WO2)
#define PORT_PA10F_TCC0_WO2                        ((1UL) << 10)

#define PIN_PA18F_TCC0_WO2                         (18L)        
#define MUX_PA18F_TCC0_WO2                         (5L)        
#define PINMUX_PA18F_TCC0_WO2                      ((PIN_PA18F_TCC0_WO2 << 16) | MUX_PA18F_TCC0_WO2)
#define PORT_PA18F_TCC0_WO2                        ((1UL) << 18)

#define PIN_PA11F_TCC0_WO3                         (11L)        
#define MUX_PA11F_TCC0_WO3                         (5L)        
#define PINMUX_PA11F_TCC0_WO3                      ((PIN_PA11F_TCC0_WO3 << 16) | MUX_PA11F_TCC0_WO3)
#define PORT_PA11F_TCC0_WO3                        ((1UL) << 11)

#define PIN_PA19F_TCC0_WO3                         (19L)        
#define MUX_PA19F_TCC0_WO3                         (5L)        
#define PINMUX_PA19F_TCC0_WO3                      ((PIN_PA19F_TCC0_WO3 << 16) | MUX_PA19F_TCC0_WO3)
#define PORT_PA19F_TCC0_WO3                        ((1UL) << 19)

