Microchip-MPLAB-Harmony/csp/apps/adc/adc_sample/firmware/src/packs/ATSAMHA1G16AB_DFP/pio/samha1g16ab.h
#define PIN_PB10F_TCC0_WO4                         (42L)        
#define MUX_PB10F_TCC0_WO4                         (5L)        
#define PINMUX_PB10F_TCC0_WO4                      ((PIN_PB10F_TCC0_WO4 << 16) | MUX_PB10F_TCC0_WO4)
#define PORT_PB10F_TCC0_WO4                        ((1UL) << 10)

#define PIN_PB16F_TCC0_WO4                         (48L)        
#define MUX_PB16F_TCC0_WO4                         (5L)        
#define PINMUX_PB16F_TCC0_WO4                      ((PIN_PB16F_TCC0_WO4 << 16) | MUX_PB16F_TCC0_WO4)
#define PORT_PB16F_TCC0_WO4                        ((1UL) << 16)

#define PIN_PA14F_TCC0_WO4                         (14L)        
#define MUX_PA14F_TCC0_WO4                         (5L)        
#define PINMUX_PA14F_TCC0_WO4                      ((PIN_PA14F_TCC0_WO4 << 16) | MUX_PA14F_TCC0_WO4)
#define PORT_PA14F_TCC0_WO4                        ((1UL) << 14)

#define PIN_PB11F_TCC0_WO5                         (43L)        
#define MUX_PB11F_TCC0_WO5                         (5L)        
#define PINMUX_PB11F_TCC0_WO5                      ((PIN_PB11F_TCC0_WO5 << 16) | MUX_PB11F_TCC0_WO5)
#define PORT_PB11F_TCC0_WO5                        ((1UL) << 11)

#define PIN_PB17F_TCC0_WO5                         (49L)        
#define MUX_PB17F_TCC0_WO5                         (5L)        
#define PINMUX_PB17F_TCC0_WO5                      ((PIN_PB17F_TCC0_WO5 << 16) | MUX_PB17F_TCC0_WO5)
#define PORT_PB17F_TCC0_WO5                        ((1UL) << 17)

#define PIN_PA15F_TCC0_WO5                         (15L)        
#define MUX_PA15F_TCC0_WO5                         (5L)        
#define PINMUX_PA15F_TCC0_WO5                      ((PIN_PA15F_TCC0_WO5 << 16) | MUX_PA15F_TCC0_WO5)
#define PORT_PA15F_TCC0_WO5                        ((1UL) << 15)

#define PIN_PA20F_TCC0_WO6                         (20L)        
#define MUX_PA20F_TCC0_WO6                         (5L)        
#define PINMUX_PA20F_TCC0_WO6                      ((PIN_PA20F_TCC0_WO6 << 16) | MUX_PA20F_TCC0_WO6)
#define PORT_PA20F_TCC0_WO6                        ((1UL) << 20)

#define PIN_PA16F_TCC0_WO6                         (16L)        
#define MUX_PA16F_TCC0_WO6                         (5L)        
#define PINMUX_PA16F_TCC0_WO6                      ((PIN_PA16F_TCC0_WO6 << 16) | MUX_PA16F_TCC0_WO6)
#define PORT_PA16F_TCC0_WO6                        ((1UL) << 16)

#define PIN_PA21F_TCC0_WO7                         (21L)        
#define MUX_PA21F_TCC0_WO7                         (5L)        
#define PINMUX_PA21F_TCC0_WO7                      ((PIN_PA21F_TCC0_WO7 << 16) | MUX_PA21F_TCC0_WO7)
#define PORT_PA21F_TCC0_WO7                        ((1UL) << 21)

#define PIN_PA17F_TCC0_WO7                         (17L)        
#define MUX_PA17F_TCC0_WO7                         (5L)        
#define PINMUX_PA17F_TCC0_WO7                      ((PIN_PA17F_TCC0_WO7 << 16) | MUX_PA17F_TCC0_WO7)
#define PORT_PA17F_TCC0_WO7                        ((1UL) << 17)

/* ========== PORT definition for TCC1 peripheral ========== */
#define PIN_PA06E_TCC1_WO0                         (6L)         
#define MUX_PA06E_TCC1_WO0                         (4L)        
#define PINMUX_PA06E_TCC1_WO0                      ((PIN_PA06E_TCC1_WO0 << 16) | MUX_PA06E_TCC1_WO0)
#define PORT_PA06E_TCC1_WO0                        ((1UL) << 6)

#define PIN_PA10E_TCC1_WO0                         (10L)        
#define MUX_PA10E_TCC1_WO0                         (4L)        
#define PINMUX_PA10E_TCC1_WO0                      ((PIN_PA10E_TCC1_WO0 << 16) | MUX_PA10E_TCC1_WO0)
#define PORT_PA10E_TCC1_WO0                        ((1UL) << 10)

#define PIN_PA30E_TCC1_WO0                         (30L)        
#define MUX_PA30E_TCC1_WO0                         (4L)        
#define PINMUX_PA30E_TCC1_WO0                      ((PIN_PA30E_TCC1_WO0 << 16) | MUX_PA30E_TCC1_WO0)
#define PORT_PA30E_TCC1_WO0                        ((1UL) << 30)

#define PIN_PA07E_TCC1_WO1                         (7L)         
#define MUX_PA07E_TCC1_WO1                         (4L)        
#define PINMUX_PA07E_TCC1_WO1                      ((PIN_PA07E_TCC1_WO1 << 16) | MUX_PA07E_TCC1_WO1)
#define PORT_PA07E_TCC1_WO1                        ((1UL) << 7)

#define PIN_PA11E_TCC1_WO1                         (11L)        
#define MUX_PA11E_TCC1_WO1                         (4L)        
#define PINMUX_PA11E_TCC1_WO1                      ((PIN_PA11E_TCC1_WO1 << 16) | MUX_PA11E_TCC1_WO1)
#define PORT_PA11E_TCC1_WO1                        ((1UL) << 11)

#define PIN_PA31E_TCC1_WO1                         (31L)        
#define MUX_PA31E_TCC1_WO1                         (4L)        
#define PINMUX_PA31E_TCC1_WO1                      ((PIN_PA31E_TCC1_WO1 << 16) | MUX_PA31E_TCC1_WO1)
#define PORT_PA31E_TCC1_WO1                        ((1UL) << 31)

#define PIN_PA08F_TCC1_WO2                         (8L)         
#define MUX_PA08F_TCC1_WO2                         (5L)        
#define PINMUX_PA08F_TCC1_WO2                      ((PIN_PA08F_TCC1_WO2 << 16) | MUX_PA08F_TCC1_WO2)
#define PORT_PA08F_TCC1_WO2                        ((1UL) << 8)

#define PIN_PB30F_TCC1_WO2                         (62L)        
#define MUX_PB30F_TCC1_WO2                         (5L)        
#define PINMUX_PB30F_TCC1_WO2                      ((PIN_PB30F_TCC1_WO2 << 16) | MUX_PB30F_TCC1_WO2)
#define PORT_PB30F_TCC1_WO2                        ((1UL) << 30)

#define PIN_PA09F_TCC1_WO3                         (9L)         
#define MUX_PA09F_TCC1_WO3                         (5L)        
#define PINMUX_PA09F_TCC1_WO3                      ((PIN_PA09F_TCC1_WO3 << 16) | MUX_PA09F_TCC1_WO3)
#define PORT_PA09F_TCC1_WO3                        ((1UL) << 9)

/* ========== PORT definition for TCC2 peripheral ========== */
#define PIN_PA16E_TCC2_WO0                         (16L)        
#define MUX_PA16E_TCC2_WO0                         (4L)        
#define PINMUX_PA16E_TCC2_WO0                      ((PIN_PA16E_TCC2_WO0 << 16) | MUX_PA16E_TCC2_WO0)
#define PORT_PA16E_TCC2_WO0                        ((1UL) << 16)

#define PIN_PA00E_TCC2_WO0                         (0L)         
#define MUX_PA00E_TCC2_WO0                         (4L)        
#define PINMUX_PA00E_TCC2_WO0                      ((PIN_PA00E_TCC2_WO0 << 16) | MUX_PA00E_TCC2_WO0)
#define PORT_PA00E_TCC2_WO0                        ((1UL) << 0)

#define PIN_PA17E_TCC2_WO1                         (17L)        
#define MUX_PA17E_TCC2_WO1                         (4L)        
#define PINMUX_PA17E_TCC2_WO1                      ((PIN_PA17E_TCC2_WO1 << 16) | MUX_PA17E_TCC2_WO1)
#define PORT_PA17E_TCC2_WO1                        ((1UL) << 17)

#define PIN_PA01E_TCC2_WO1                         (1L)         
#define MUX_PA01E_TCC2_WO1                         (4L)        
#define PINMUX_PA01E_TCC2_WO1                      ((PIN_PA01E_TCC2_WO1 << 16) | MUX_PA01E_TCC2_WO1)
#define PORT_PA01E_TCC2_WO1                        ((1UL) << 1)



#endif /* _SAMHA1G16AB_GPIO_H_ */

